app/Http/Controllers/API/V1/CompteController.php

select count(*) as aggregate from "comptes" where "comptes"."deleted_at" is null and "deleted_at" is null
---
    public function index(Request $request)
    {
        // Validation des paramètres en utilisant les règles du scope
        $validated = $request->validate(\App\Models\Scopes\CompteQueryScope::getValidationRules());

        // Pour les tests sans authentification, on simule un admin (voit tous les comptes)
        // $user = Auth::user();

        // Construction de la requête avec le scope global
        $query = Compte::query();

        // Appliquer tous les filtres via le scope global
        $comptes = \App\Models\Scopes\CompteQueryScope::applyFiltersToQuery($query, $validated)->paginate(
            $validated['limit'] ?? 10,
            ['*'],
            'page',
            $validated['page'] ?? 1
        );

select count(*) as aggregate from "comptes" where "comptes"."deleted_at" is not null and "deleted_at" is null
---
    public function archived(Request $request)
    {
        // Validation des paramètres
        $validated = $request->validate([
            'page' => 'integer|min:1',
            'limit' => 'integer|min:1|max:100'
        ]);

        // Récupération des comptes archivés avec pagination
        $perPage = $request->get('limit', 10);
        $comptes = Compte::onlyTrashed()->paginate($perPage);